[
    {
        "topic": 1,
        "id": 1,
        "text": "Your company has serval departments. Each department has a number of virtual machines (VMs). The company has an Azure subscription that contains a resource group named RG1. All VMs are located in RG1. You want to associate each VM with its respective department. What should you do?",
        "answers": [
            {
                "letter": "A",
                "text": "Create Azure Management Groups for each department."
            },
            {
                "letter": "B",
                "text": "Create a resource group for each department."
            },
            {
                "letter": "C",
                "text": "Assign tags to the virtual machines."
            },
            {
                "letter": "D",
                "text": "Modify the settings of the virtual machines."
            }
        ],
        "correct_answer": "C",
        "comment": "Reference: https://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-group-using-tags",
        "image": null
    },
    {
        "topic": 1,
        "id": 2,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an Azure Active Directory (Azure AD) subscription. You want to implement an Azure AD conditional access policy. The policy must be configured to require members of the Global Administrators group to use Multi-Factor Authentication and an Azure AD-joined device when they connect to Azure AD from untrusted locations. Solution: You access the multi-factor authentication page to alter the user settings. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "",
        "image": null
    },
    {
        "topic": 1,
        "id": 3,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an Azure Active Directory (Azure AD) subscription. You want to implement an Azure AD conditional access policy. The policy must be configured to require members of the Global Administrators group to use Multi-Factor Authentication and an Azure AD-joined device when they connect to Azure AD from untrusted locations. Solution: You access the Azure portal to alter the session control of the Azure AD conditional access policy. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "",
        "image": null
    },
    {
        "topic": 1,
        "id": 4,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an Azure Active Directory (Azure AD) subscription. You want to implement an Azure AD conditional access policy. The policy must be configured to require members of the Global Administrators group to use Multi-Factor Authentication and an Azure AD-joined device when they connect to Azure AD from untrusted locations. Solution: You access the Azure portal to alter the grant control of the Azure AD conditional access policy. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "",
        "image": null
    },
    {
        "topic": 1,
        "id": 5,
        "text": "You are planning to deploy an Ubuntu Server virtual machine to your company's Azure subscription. You are required to implement a custom deployment that includes adding a particular trusted root certification authority (CA). Which of the following should you use to create the virtual machine?",
        "answers": [
            {
                "letter": "A",
                "text": "The New-AzureRmVm cmdlet."
            },
            {
                "letter": "B",
                "text": "The New-AzVM cmdlet."
            },
            {
                "letter": "C",
                "text": "The Create-AzVM cmdlet."
            },
            {
                "letter": "D",
                "text": "The az vm create command."
            }
        ],
        "correct_answer": "C",
        "comment": "Once Cloud-init.txt has been created, you can deploy the VM with az vm create cmdlet, using the --custom-data parameter to provide the full path to the cloud-init.txt file. Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/linux/tutorial-automate-vm-deployment",
        "image": null
    },
    {
        "topic": 1,
        "id": 6,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company makes use of Multi-Factor Authentication for when users are not in the office. The Per Authentication option has been configured as the usage model. After the acquisition of a smaller business and the addition of the new staff to Azure Active Directory (Azure AD), you are informed that these employees should also make use of Multi-Factor Authentication. To achieve this, the Per Enabled User setting must be set for the usage model. Solution: You reconfigure the existing usage model via the Azure portal. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "Since it is not possible to change the usage model of an existing provider as it is right now, you have to create a new one and reactivate your existing server with activation credentials from the new provider. Reference: https://365lab.net/2015/04/11/switch-usage-model-in-azure-multi-factor-authentication-server/",
        "image": null
    },
    {
        "topic": 1,
        "id": 7,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company's Azure solution makes use of Multi-Factor Authentication for when users are not in the office. The Per Authentication option has been configured as the usage model. After the acquisition of a smaller business and the addition of the new staff to Azure Active Directory (Azure AD), you are informed that these employees should also make use of Multi-Factor Authentication. To achieve this, the Per Enabled User setting must be set for the usage model. Solution: You reconfigure the existing usage model via the Azure CLI. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "Since it is not possible to change the usage model of an existing provider as it is right now, you have to create a new one and reactivate your existing server with activation credentials from the new provider. Reference: https://365lab.net/2015/04/11/switch-usage-model-in-azure-multi-factor-authentication-server/",
        "image": null
    },
    {
        "topic": 1,
        "id": 8,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company's Azure solution makes use of Multi-Factor Authentication for when users are not in the office. The Per Authentication option has been configured as the usage model. After the acquisition of a smaller business and the addition of the new staff to Azure Active Directory (Azure AD), you are informed that these employees should also make use of Multi-Factor Authentication. To achieve this, the Per Enabled User setting must be set for the usage model. Solution: You create a new Multi-Factor Authentication provider with a backup from the existing Multi-Factor Authentication provider data. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "Since it is not possible to change the usage model of an existing provider as it is right now, you have to create a new one and reactivate your existing server with activation credentials from the new provider. Reference: https://365lab.net/2015/04/11/switch-usage-model-in-azure-multi-factor-authentication-server/",
        "image": null
    },
    {
        "topic": 1,
        "id": 9,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an Azure Active Directory (Azure AD) tenant named weyland.com that is configured for hybrid coexistence with the on-premises Active Directory domain. You have a server named DirSync1 that is configured as a DirSync server. You create a new user account in the on-premise Active Directory. You now need to replicate the user information to Azure AD immediately. Solution: You run the Start-ADSyncSyncCycle -PolicyType Initial PowerShell cmdlet. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "Reference: https://blog.kloud.com.au/2016/03/08/azure-ad-connect-manual-sync-cycle-with-powershell-start-adsyncsynccycle/",
        "image": null
    },
    {
        "topic": 1,
        "id": 10,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an Azure Active Directory (Azure AD) tenant named weyland.com that is configured for hybrid coexistence with the on-premises Active Directory domain. You have a server named DirSync1 that is configured as a DirSync server. You create a new user account in the on-premise Active Directory. You now need to replicate the user information to Azure AD immediately. Solution: You use Active Directory Sites and Services to force replication of the Global Catalog on a domain controller. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "",
        "image": null
    },
    {
        "topic": 1,
        "id": 11,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an Azure Active Directory (Azure AD) tenant named weyland.com that is configured for hybrid coexistence with the on-premises Active Directory domain. You have a server named DirSync1 that is configured as a DirSync server. You create a new user account in the on-premise Active Directory. You now need to replicate the user information to Azure AD immediately. Solution: You restart the NetLogon service on a domain controller. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "Community vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 12,
        "text": "Your company has a Microsoft Azure subscription. The company has datacenters in Los Angeles and New York. You are configuring the two datacenters as geo-clustered sites for site resiliency. You need to recommend an Azure storage redundancy option. You have the following data storage requirements:\nData must be stored on multiple nodes.\nData must be stored on nodes in separate geographic locations.\nData can be read from the secondary location as well as from the primary location.\nWhich of the following Azure stored redundancy options should you recommend?",
        "answers": [
            {
                "letter": "A",
                "text": "Geo-redundant storage"
            },
            {
                "letter": "B",
                "text": "Read-only geo-redundant storage"
            },
            {
                "letter": "C",
                "text": "Zone-redundant storage"
            },
            {
                "letter": "D",
                "text": "Locally redundant storage"
            }
        ],
        "correct_answer": "B",
        "comment": "RA-GRS allows you to have higher read availability for your storage account by providing \"read only\" access to the data replicated to the secondary location. Once you enable this feature, the secondary location may be used to achieve higher availability in the event the data is not available in the primary region. This is an \"opt-in\" feature which requires the storage account be geo-replicated. Reference: https://docs.microsoft.com/en-us/azure/storage/common/storage-redundancy\nCommunity vote distribution B (97%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 13,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an azure subscription that includes a storage account, a resource group, a blob container and a file share. A colleague named Jon Ross makes use of a solitary Azure Resource Manager (ARM) template to deploy a virtual machine and an additional Azure Storage account. You want to review the ARM template that was used by Jon Ross. Solution: You access the Virtual Machine blade. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "You should use the Resource Group blade. Reference: https://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-manager-export-template\nCommunity vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 14,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an azure subscription that includes a storage account, a resource group, a blob container and a file share. A colleague named Jon Ross makes use of a solitary Azure Resource Manager (ARM) template to deploy a virtual machine and an additional Azure Storage account. You want to review the ARM template that was used by Jon Ross. Solution: You access the Resource Group blade. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "To view a template from deployment history:\n1. Go to the resource group for your new resource group. Notice that the portal shows the result of the last deployment. Select this link.\n2. You see a history of deployments for the group. In your case, the portal probably lists only one deployment. Select this deployment.\n3. The portal displays a summary of the deployment. The summary includes the status of the deployment and its operations and the values that you provided for parameters. To see the template that you used for the deployment, select View template.\nReference: https://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-manager-export-template\nCommunity vote distribution A (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 15,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has an azure subscription that includes a storage account, a resource group, a blob container and a file share. A colleague named Jon Ross makes use of a solitary Azure Resource Manager (ARM) template to deploy a virtual machine and an additional Azure Storage account. You want to review the ARM template that was used by Jon Ross. Solution: You access the Container blade. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "You should use the Resource Group blade. Reference: https://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-manager-export-template\nCommunity vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 16,
        "text": "Your company has three virtual machines (VMs) that are included in an availability set. You try to resize one of the VMs, which returns an allocation failure message. It is imperative that the VM is resized. Which of the following actions should you take?",
        "answers": [
            {
                "letter": "A",
                "text": "You should only stop one of the VMs."
            },
            {
                "letter": "B",
                "text": "You should stop two of the VMs."
            },
            {
                "letter": "C",
                "text": "You should stop all three VMs."
            },
            {
                "letter": "D",
                "text": "You should remove the necessary VM from the availability set."
            }
        ],
        "correct_answer": "C",
        "comment": "If the VM you wish to resize is part of an availability set, then you must stop all VMs in the availability set before changing the size of any VM in the availability set. The reason all VMs in the availability set must be stopped before performing the resize operation to a size that requires different hardware is that all running VMs in the availability set must be using the same physical hardware cluster. Therefore, if a change of physical hardware cluster is required to change the VM size then all VMs must be first stopped and then restarted one-by-one to a different physical hardware clusters. Reference: https://azure.microsoft.com/es-es/blog/resize-virtual-machines/ Community vote distribution C (96%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 17,
        "text": "You have an Azure virtual machine (VM) that has a single data disk. You have been tasked with attaching this data disk to another Azure VM. You need to make sure that your strategy allows for the virtual machines to be offline for the least amount of time possible. Which of the following is the action you should take FIRST?",
        "answers": [
            {
                "letter": "A",
                "text": "Stop the VM that includes the data disk."
            },
            {
                "letter": "B",
                "text": "Stop the VM that the data disk must be attached to."
            },
            {
                "letter": "C",
                "text": "Detach the data disk."
            },
            {
                "letter": "D",
                "text": "Delete the VM that includes the data disk."
            }
        ],
        "correct_answer": "A",
        "comment": "Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/detach-disk https://docs.microsoft.com/en-us/azure/lab-services/devtestlab-attach-detach-data-disk Community vote distribution C (75%) A (23%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 18,
        "text": "Your company has an Azure subscription. You need to deploy a number of Azure virtual machines (VMs) using Azure Resource Manager (ARM) templates. You have been informed that the VMs will be included in a single availability set. You are required to make sure that the ARM template you configure allows for as many VMs as possible to remain accessible in the event of fabric failure or maintenance. Which of the following is the value that you should configure for the platformFaultDomainCount property?",
        "answers": [
            {
                "letter": "A",
                "text": "10"
            },
            {
                "letter": "B",
                "text": "30"
            },
            {
                "letter": "C",
                "text": "Min Value"
            },
            {
                "letter": "D",
                "text": "Max Value"
            }
        ],
        "correct_answer": "D",
        "comment": "The number of fault domains for managed availability sets varies by region - either two or three per region. Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/manage-availability Community vote distribution D (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 19,
        "text": "Your company has an Azure subscription. You need to deploy a number of Azure virtual machines (VMs) using Azure Resource Manager (ARM) templates. You have been informed that the VMs will be included in a single availability set. You are required to make sure that the ARM template you configure allows for as many VMs as possible to remain accessible in the event of fabric failure or maintenance. Which of the following is the value that you should configure for the platformUpdateDomainCount property?",
        "answers": [
            {
                "letter": "A",
                "text": "10"
            },
            {
                "letter": "B",
                "text": "20"
            },
            {
                "letter": "C",
                "text": "30"
            },
            {
                "letter": "D",
                "text": "40"
            }
        ],
        "correct_answer": "B",
        "comment": "Each virtual machine in your availability set is assigned an update domain and a fault domain by the underlying Azure platform. For a given availability set, five non-user-configurable update domains are assigned by default (Resource Manager deployments can then be increased to provide up to 20 update domains) to indicate groups of virtual machines and underlying physical hardware that can be rebooted at the same time. Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/availability-set-overview Community vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 20,
        "text": "DRAG DROP - You have downloaded an Azure Resource Manager (ARM) template to deploy numerous virtual machines (VMs). The ARM template is based on a current VM, but must be adapted to reference an administrative password. You need to make sure that the password cannot be stored in plain text. You are preparing to create the necessary components to achieve your goal. Which of the following should you create to achieve your goal? Answer by dragging the correct option from the list to the answer area. Select and Place:",
        "answers": [
            {
                "letter": "A",
                "text": "An Azure Key Vault"
            },
            {
                "letter": "B",
                "text": "An Azure Storage account"
            },
            {
                "letter": "C",
                "text": "Azure Active Directory (Azure AD) Identity Protection"
            },
            {
                "letter": "D",
                "text": "An access policy"
            },
            {
                "letter": "E",
                "text": "An Azure policy"
            },
            {
                "letter": "F",
                "text": "A backup policy"
            }
        ],
        "correct_answer": "AD",
        "comment": "You can use a template that allows you to deploy a simple Windows VM by retrieving the password that is stored in a Key Vault. Therefore, the password is never put in plain text in the template parameter file.",
        "image": null
    },
    {
        "topic": 1,
        "id": 21,
        "text": "Your company has an Azure Active Directory (Azure AD) tenant that is configured for hybrid coexistence with the on-premises Active Directory domain. The on-premise virtual environment consists of virtual machines (VMs) running on Windows Server 2012 R2 Hyper-V host servers. You have created some PowerShell scripts to automate the configuration of newly created VMs. You plan to create several new VMs. You need a solution that ensures the scripts are run on the new VMs. Which of the following is the best solution?",
        "answers": [
            {
                "letter": "A",
                "text": "Configure a SetupComplete.cmd batch file in the %windir%\\setup\\scripts directory."
            },
            {
                "letter": "B",
                "text": "Configure a Group Policy Object (GPO) to run the scripts as logon scripts."
            },
            {
                "letter": "C",
                "text": "Configure a Group Policy Object (GPO) to run the scripts as startup scripts."
            },
            {
                "letter": "D",
                "text": "Place the scripts in a new virtual hard disk (VHD)."
            }
        ],
        "correct_answer": "A",
        "comment": "After you deploy a Virtual Machine you typically need to make some changes before it's ready to use. This can be done manually, via Remote PowerShell, or using the CustomScript extension executed by the VM Agent. The CustomScript extension allows specifying scripts (.ps1) to run automatically during setup. Reference: https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/add-a-custom-script-to-windows-setup https://azure.microsoft.com/en-us/blog/automating-vm-customization-tasks-using-custom-script-extension/ Community vote distribution A (82%) C (18%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 22,
        "text": "Your company has an Azure Active Directory (Azure AD) tenant that is configured for hybrid coexistence with the on-premises Active Directory domain. You plan to deploy several new virtual machines (VMs) in Azure. The VMs will have the same operating system and custom software requirements. You configure a reference VM in the on-premise virtual environment. You then generalize the VM to create an image. You need to upload the image to Azure to ensure that it is available for selection when you create the new Azure VMs. Which PowerShell cmdlets should you use?",
        "answers": [
            {
                "letter": "A",
                "text": "Add-AzVM"
            },
            {
                "letter": "B",
                "text": "Add-AzVhd"
            },
            {
                "letter": "C",
                "text": "Add-AzImage"
            },
            {
                "letter": "D",
                "text": "Add-AzImageDataDisk"
            }
        ],
        "correct_answer": "B",
        "comment": "The Add-AzVhd cmdlet uploads on-premises virtual hard disks (.vhd files) to a blob storage account as fixed virtual hard disks. Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/upload-generalized-managed Community vote distribution B (94%) 6%",
        "image": null
    },
    {
        "topic": 1,
        "id": 23,
        "text": "DRAG DROP - Your company has an Azure subscription that includes a number of Azure virtual machines (VMs), which are all part of the same virtual network. Your company also has an on-premises Hyper-V server that hosts a VM, named VM1, which must be replicated to Azure. Which of the following objects must be created to achieve this goal? Answer by dragging the correct option from the list to the answer area.",
        "answers": [
            {
                "letter": "A",
                "text": "Hyper-V site"
            },
            {
                "letter": "B",
                "text": "Storage account"
            },
            {
                "letter": "C",
                "text": "Azure Recovery Services Vault"
            },
            {
                "letter": "D",
                "text": "Azure Traffic Manager instance"
            },
            {
                "letter": "E",
                "text": "Replication policy"
            },
            {
                "letter": "F",
                "text": "Endpoint"
            }
        ],
        "correct_answer": "ACE",
        "comment": null,
        "image": null
    },
    {
        "topic": 1,
        "id": 24,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company's Azure subscription includes two Azure networks named VirtualNetworkA and VirtualNetworkB. VirtualNetworkA includes a VPN gateway that is configured to make use of static routing. Also, a site-to-site VPN connection exists between your company's on-premises network and VirtualNetworkA. You have configured a point-to-site VPN connection to VirtualNetworkA from a workstation running Windows 10. After configuring virtual network peering between VirtualNetworkA and VirtualNetworkB, you confirm that you are able to access VirtualNetworkB from the company's on-premises network. However, you find that you cannot establish a connection to VirtualNetworkB from the Windows 10 workstation. You have to make sure that a connection to VirtualNetworkB can be established from the Windows 10 workstation. Solution: You choose the Allow gateway transit setting on VirtualNetworkA. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "Allow gateway transit must be configured on the peered virtual network that does not have a gateway (VirtualNetworkB), but static routing and point-to-site VPN have limitations that prevent full transit.",
        "image": null
    },
    {
        "topic": 1,
        "id": 25,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company's Azure subscription includes two Azure networks named VirtualNetworkA and VirtualNetworkB. VirtualNetworkA includes a VPN gateway that is configured to make use of static routing. Also, a site-to-site VPN connection exists between your company's on-premises network and VirtualNetworkA. You have configured a point-to-site VPN connection to VirtualNetworkA from a workstation running Windows 10. After configuring virtual network peering between VirtualNetworkA and VirtualNetworkB, you confirm that you are able to access VirtualNetworkB from the company's on-premises network. However, you find that you cannot establish a connection to VirtualNetworkB from the Windows 10 workstation. You have to make sure that a connection to VirtualNetworkB can be established from the Windows 10 workstation. Solution: You choose the Allow gateway transit setting on VirtualNetworkB. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "Allow gateway transit is needed on the peered network without gateway (VirtualNetworkB), but static routing and point-to-site VPN limitations prevent the connection.",
        "image": null
    },
    {
        "topic": 1,
        "id": 26,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company's Azure subscription includes two Azure networks named VirtualNetworkA and VirtualNetworkB. VirtualNetworkA includes a VPN gateway that is configured to make use of static routing. Also, a site-to-site VPN connection exists between your company's on-premises network and VirtualNetworkA. You have configured a point-to-site VPN connection to VirtualNetworkA from a workstation running Windows 10. After configuring virtual network peering between VirtualNetworkA and VirtualNetworkB, you confirm that you are able to access VirtualNetworkB from the company's on-premises network. However, you find that you cannot establish a connection to VirtualNetworkB from the Windows 10 workstation. You have to make sure that a connection to VirtualNetworkB can be established from the Windows 10 workstation. Solution: You download and re-install the VPN client configuration package on the Windows 10 workstation. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "After changes such as virtual network peering, the VPN client configuration must be re-downloaded and re-installed on the client machine to update routes.",
        "image": null
    },
    {
        "topic": 1,
        "id": 27,
        "text": "Your company has virtual machines (VMs) hosted in Microsoft Azure. The VMs are located in a single Azure virtual network named VNet1. The company has users that work remotely. The remote workers require access to the VMs on VNet1. You need to provide access for the remote workers. What should you do?",
        "answers": [
            {
                "letter": "A",
                "text": "Configure a Site-to-Site (S2S) VPN."
            },
            {
                "letter": "B",
                "text": "Configure a VNet-toVNet VPN."
            },
            {
                "letter": "C",
                "text": "Configure a Point-to-Site (P2S) VPN."
            },
            {
                "letter": "D",
                "text": "Configure DirectAccess on a Windows Server 2012 server VM."
            },
            {
                "letter": "E",
                "text": "Configure a Multi-Site VPN."
            }
        ],
        "correct_answer": "C",
        "comment": "A Point-to-Site (P2S) VPN gateway connection lets you create a secure connection to your virtual network from an individual client computer. Reference: https://docs.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-about-vpngateways",
        "image": null
    },
    {
        "topic": 1,
        "id": 28,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has a Microsoft SQL Server Always On availability group configured on their Azure virtual machines (VMs). You need to configure an Azure internal load balancer as a listener for the availability group. Solution: You create an HTTP health probe on port 1433. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "The solution does not meet the goal because SQL Server Always On availability groups require a TCP health probe on port 1433, not an HTTP probe. Reference: https://docs.microsoft.com/en-us/azure/architecture/reference-architectures/databases/sql-database-ha-dr",
        "image": null
    },
    {
        "topic": 1,
        "id": 29,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has a Microsoft SQL Server Always On availability group configured on their Azure virtual machines (VMs). You need to configure an Azure internal load balancer as a listener for the availability group. Solution: You set Session persistence to Client IP. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "The solution does not meet the goal because for SQL Server Always On availability group listeners, session persistence must be set to None or Client IP and protocol, but Client IP alone is insufficient. Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/sql/virtual-machines-windows-portal-sql-alwayson-int-listener",
        "image": null
    },
    {
        "topic": 1,
        "id": 30,
        "text": "Note: The question is included in a number of questions that depicts the identical set-up. However, every question has a distinctive result. Establish if the solution satisfies the requirements. Your company has a Microsoft SQL Server Always On availability group configured on their Azure virtual machines (VMs). You need to configure an Azure internal load balancer as a listener for the availability group. Solution: You enable Floating IP. Does the solution meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "Enabling Floating IP is required for Azure internal load balancers used as listeners for SQL Server Always On availability groups to properly direct traffic to the active node. Reference: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/sql/virtual-machines-windows-portal-sql-alwayson-int-listener",
        "image": null
    },
    {
        "topic": 1,
        "id": 31,
        "text": "Your company has two on-premises servers named SRV01 and SRV02. Developers have created an application that runs on SRV01. The application calls a service on SRV02 by IP address. You plan to migrate the application on Azure virtual machines (VMs). You have configured two VMs on a single subnet in an Azure virtual network. You need to configure the two VMs with static internal IP addresses. What should you do?",
        "answers": [
            {
                "letter": "A",
                "text": "Run the New-AzureRMVMConfig PowerShell cmdlet."
            },
            {
                "letter": "B",
                "text": "Run the Set-AzureSubnet PowerShell cmdlet."
            },
            {
                "letter": "C",
                "text": "Modify the VM properties in the Azure Management Portal."
            },
            {
                "letter": "D",
                "text": "Modify the IP properties in Windows Network and Sharing Center."
            },
            {
                "letter": "E",
                "text": "Run the Set-AzureStaticVNetIP PowerShell cmdlet."
            }
        ],
        "correct_answer": "E",
        "comment": "Specify a static internal IP for a previously created VM. If you want to set a static IP address for a VM that you previously created, you can do so by using the following cmdlets. If you already set an IP address for the VM and you want to change it to a different IP address, you'll need to remove the existing static IP address before running these cmdlets. See the instructions below to remove a static IP. For this procedure, you'll use the Update-AzureVM cmdlet. The Update-AzureVM cmdlet restarts the VM as part of the update process. The DIP that you specify will be assigned after the VM restarts. In this example, we set the IP address for VM2, which is located in cloud service StaticDemo. Get-AzureVM -ServiceName StaticDemo -Name VM2 | Set-AzureStaticVNetIP -IPAddress 192.168.4.7 | Update-AzureVM Community vote distribution E (75%) C (25%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 32,
        "text": "Community vote distribution A (100%)",
        "answers": [
            {
                "letter": "A",
                "text": "5"
            },
            {
                "letter": "B",
                "text": "10"
            },
            {
                "letter": "C",
                "text": "20"
            },
            {
                "letter": "D",
                "text": "40"
            }
        ],
        "correct_answer": "A",
        "comment": "Each VM requires one network interface card (NIC) to have both a public and private IP address, and identical security rules can be applied using network security groups. Reference: https://docs.microsoft.com/en-us/azure/virtual-network/network-interface-overview",
        "image": null
    },
    {
        "topic": 1,
        "id": 33,
        "text": "Your company has an Azure Active Directory (Azure AD) subscription. You need to deploy five virtual machines (VMs) to your company's virtual network subnet. The VMs will each have both a public and private IP address. Inbound and outbound security rules for all of these virtual machines must be identical. Which of the following is the least amount of security groups needed for this configuration?",
        "answers": [
            {
                "letter": "A",
                "text": "4"
            },
            {
                "letter": "B",
                "text": "3"
            },
            {
                "letter": "C",
                "text": "2"
            },
            {
                "letter": "D",
                "text": "1"
            }
        ],
        "correct_answer": "D",
        "comment": "You can assign a single Network Security Group (NSG) with the required inbound and outbound rules to all VMs, ensuring identical security policies and minimizing the number of NSGs needed.",
        "image": null
    },
    {
        "topic": 1,
        "id": 34,
        "text": "Your company's Azure subscription includes Azure virtual machines (VMs) that run Windows Server 2016. One of the VMs is backed up every day using Azure Backup Instant Restore. When the VM becomes infected with data encrypting ransomware, you decide to recover the VM's files. Which of the following is TRUE in this scenario?",
        "answers": [
            {
                "letter": "A",
                "text": "You can only recover the files to the infected VM."
            },
            {
                "letter": "B",
                "text": "You can recover the files to any VM within the company's subscription."
            },
            {
                "letter": "C",
                "text": "You can only recover the files to a new VM."
            },
            {
                "letter": "D",
                "text": "You will not be able to recover the files."
            }
        ],
        "correct_answer": "A",
        "comment": "Community vote distribution D (100%).",
        "image": null
    },
    {
        "topic": 1,
        "id": 35,
        "text": "Your company's Azure subscription includes Azure virtual machines (VMs) that run Windows Server 2016. One of the VMs is backed up every day using Azure Backup Instant Restore. When the VM becomes infected with data encrypting ransomware, you are required to restore the VM. Which of the following actions should you take?",
        "answers": [
            {
                "letter": "A",
                "text": "You should restore the VM after deleting the infected VM."
            },
            {
                "letter": "B",
                "text": "You should restore the VM to any VM within the company's subscription."
            },
            {
                "letter": "C",
                "text": "You should restore the VM to a new Azure VM."
            },
            {
                "letter": "D",
                "text": "You should restore the VM to an on-premise Windows device."
            }
        ],
        "correct_answer": "B",
        "comment": "Community vote distribution\nC (89%) 11%",
        "image": null
    },
    {
        "topic": 1,
        "id": 36,
        "text": "You administer a solution in Azure that is currently having performance issues. You need to find the cause of the performance issues pertaining to metrics on the Azure infrastructure. Which of the following is the tool you should use?",
        "answers": [
            {
                "letter": "A",
                "text": "Azure Traffic Analytics"
            },
            {
                "letter": "B",
                "text": "Azure Monitor"
            },
            {
                "letter": "C",
                "text": "Azure Activity Log"
            },
            {
                "letter": "D",
                "text": "Azure Advisor"
            }
        ],
        "correct_answer": "B",
        "comment": "Metrics in Azure Monitor are stored in a time-series database which is optimized for analyzing time-stamped data. This makes metrics particularly suited for alerting and fast detection of issues.\nCommunity vote distribution\nB (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 37,
        "text": "Your company has an Azure subscription that includes a Recovery Services vault. You want to use Azure Backup to schedule a backup of your company's virtual machines (VMs) to the Recovery Services vault. Which of the following VMs can you back up? Choose all that apply.",
        "answers": [
            {
                "letter": "A",
                "text": "VMs that run Windows 10."
            },
            {
                "letter": "B",
                "text": "VMs that run Windows Server 2012 or higher."
            },
            {
                "letter": "C",
                "text": "VMs that have NOT been shut down."
            },
            {
                "letter": "D",
                "text": "VMs that run Debian 8.2+."
            },
            {
                "letter": "E",
                "text": "VMs that have been shut down."
            }
        ],
        "correct_answer": "ABCDE",
        "comment": "Azure Backup supports backup of 64-bit Windows server operating system from Windows Server 2008.\nAzure Backup supports backup of 64-bit Windows 10 operating system.\nAzure Backup supports backup of 64-bit Debian operating system from Debian 7.9+.\nAzure Backup supports backup of VM that are shutdown or offline.\nCommunity vote distribution\nABCDE (95%) 5%",
        "image": null
    },
    {
        "topic": 1,
        "id": 38,
        "text": "You have an Azure Active Directory (Azure AD) tenant named contoso.com. You have a CSV file that contains the names and email addresses of 500 external users. You need to create a guest user account in contoso.com for each of the 500 external users.\nSolution: You create a PowerShell script that runs the New-AzureADUser cmdlet for each user.\nDoes this meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "The New-AzureADUser cmdlet creates a user in Azure Active Directory (Azure AD). Instead, you should use the New-AzureADMSInvitation cmdlet which is used to invite a new external user to your directory.\nCommunity vote distribution\nB (100%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 39,
        "text": "You have an Azure Active Directory (Azure AD) tenant named contoso.com. You have a CSV file that contains the names and email addresses of 500 external users. You need to create a guest user account in contoso.com for each of the 500 external users.\nSolution: From Azure AD in the Azure portal, you use the Bulk create user operation.\nDoes this meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "Instead, you should use the New-AzureADMSInvitation cmdlet which is used to invite a new external user to your directory.\nCommunity vote distribution\nB (90%) A (10%)",
        "image": null
    },
    {
        "topic": 1,
        "id": 40,
        "text": "You have an Azure Active Directory (Azure AD) tenant named contoso.com. You have a CSV file that contains the names and email addresses of 500 external users. You need to create a guest user account in contoso.com for each of the 500 external users.\nSolution: You create a PowerShell script that runs the New-AzureADMSInvitation cmdlet for each external user.\nDoes this meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "Use the New-AzureADMSInvitation cmdlet which is used to invite a new external user to your directory.\nCommunity vote distribution\nA (88%) B (13%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 1,
        "text": "HOTSPOT - You have an Azure subscription named Subscription1 that contains a resource group named RG1. In RG1, you create an internal load balancer named LB1 and a public load balancer named LB2. You need to ensure that an administrator named Admin1 can manage LB1 and LB2. The solution must follow the principle of least privilege. Which role should you assign to Admin1 for each task? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\nTo add a backend pool to LB1:\nContributor on LB1\nNetwork Contributor on LB1\nNetwork Contributor on RG1\nOwner on LB1\nTo add a health probe to LB2:\nContributor on LB2\nNetwork Contributor on LB2\nNetwork Contributor on RG1\nOwner on LB2",
        "answers": [
            {
                "letter": "A",
                "text": "To add a backend pool to LB1: Contributor on LB1"
            },
            {
                "letter": "B",
                "text": "To add a backend pool to LB1: Network Contributor on LB1"
            },
            {
                "letter": "C",
                "text": "To add a backend pool to LB1: Network Contributor on RG1"
            },
            {
                "letter": "D",
                "text": "To add a backend pool to LB1: Owner on LB1\n"
            },
            {
                "letter": "E",
                "text": "To add a health probe to LB2: Contributor on LB2"
            },
            {
                "letter": "F",
                "text": "To add a health probe to LB2: Network Contributor on LB2"
            },
            {
                "letter": "G",
                "text": "To add a health probe to LB2: Network Contributor on RG1"
            },
            {
                "letter": "H",
                "text": "To add a health probe to LB2: Owner on LB2"
            }
        ],
        "correct_answer": "BF",
        "comment": "The Network Contributor role lets you manage network resources like load balancers but does not grant access to them, thus following the principle of least privilege.\nReference: https://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles",
        "image": null
    },
    {
        "topic": 2,
        "id": 2,
        "text": "You have an Azure subscription that contains an Azure Active Directory (Azure AD) tenant named contoso.com and an Azure Kubernetes Service (AKS) cluster named AKS1. An administrator reports that she is unable to grant access to AKS1 to the users in contoso.com. You need to ensure that access to AKS1 can be granted to the contoso.com users. What should you do first?",
        "answers": [
            {
                "letter": "A",
                "text": "From contoso.com, modify the Organization relationships settings."
            },
            {
                "letter": "B",
                "text": "From contoso.com, create an OAuth 2.0 authorization endpoint."
            },
            {
                "letter": "C",
                "text": "Recreate AKS1."
            },
            {
                "letter": "D",
                "text": "From AKS1, create a namespace."
            }
        ],
        "correct_answer": "AC",
        "comment": "You need to create an OAuth 2.0 authorization endpoint in Azure AD to enable access delegation for users in contoso.com to AKS1.\nReference: https://kubernetes.io/docs/reference/access-authn-authz/authentication/\nCommunity vote distribution AC (91%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 4,
        "text": "HOTSPOT - You have an Azure Active Directory (Azure AD) tenant named contoso.com that contains the users shown in the following table:\n+--------+--------+-----------+\n| Name   | Type   | Member of |\n+--------+--------+-----------+\n| User1  | Member | Group1    |\n| User2  | Guest  | Group1    |\n| User3  | Member | None      |\n| UserA  | Member | Group2    |\n| UserB  | Guest  | Group2    |\n+--------+--------+-----------+\nUser3 is the owner of Group1.\nGroup2 is a member of Group1.\nYou configure an access review named Review1 as shown in the following exhibit:\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\n\n\n ---> Per rispondere Yes ad uno statement, indica Y dopo la lettera; per rispondere No, indica N (es. tutte vere rispondi AYBYCY - IN ORDINE ALFABETICO!) <---",
        "answers": [
            {
                "letter": "A",
                "text": "User3 can perform an access review of User1."
            },
            {
                "letter": "B",
                "text": "User3 can perform an access review of UserA."
            },
            {
                "letter": "C",
                "text": "User3 can perform an access review of UserB."
            }
        ],
        "correct_answer": "ANBNCY",
        "comment": "Reference: https://docs.microsoft.com/en-us/azure/active-directory/governance/create-access-review",
        "image": null
    },
    {
        "topic": 2,
        "id": 5,
        "text": "HOTSPOT - You have the Azure management groups shown in the following table:\n+--------------------+----------------------+\n| Name               | In management group   |\n+--------------------+----------------------+\n| Tenant Root Group   | Not applicable       |\n| ManagementGroup1    | Tenant Root Group    |\n| ManagementGroup2    | Tenant Root Group    |\n| ManagementGroup1    | ManagementGroup1     |\n\nYou add Azure subscriptions to the management groups as shown in the following table:\n+--------------------+----------------------+\n+---------------+---------------------+\n| Name          | Management group    |\n+---------------+---------------------+\n| Subscription1 | ManagementGroup21   |\n| Subscription2 | ManagementGroup12   |\n+---------------+---------------------+\n\nYou create the Azure policies shown in the following table:\n+---------------------------+------------------+---------------------+\n| Name                      | Parameter        | Scope               |\n+---------------------------+------------------+---------------------+\n| Not allowed resource types | virtualNetworks  | Tenant Root Group    |\n| Allowed resource types     | virtualNetworks  | ManagementGroup12    |\n+---------------------------+------------------+---------------------+\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No. \nNOTE: Each correct selection is worth one point.\n\n\n ---> Per rispondere Yes ad uno statement, indica Y dopo la lettera; per rispondere No, indica N (es. tutte vere rispondi AYBYCY - IN ORDINE ALFABETICO!) <---",
        "answers": [
            {
                "letter": "A",
                "text": "You can create a virtual network in Subscription1."
            },
            {
                "letter": "B",
                "text": "You can create a virtual network in Subscription2."
            },
            {
                "letter": "C",
                "text": "You can add Subscription1 to ManagementGroup11."
            }
        ],
        "correct_answer": "ANBYCY",
        "comment": "Box 1: No - Virtual networks are not allowed at the root and is inherited. Deny overrides allowed.\nBox 2: Yes - Virtual Machines can be created on a Management Group provided the user has the required RBAC permissions.\nBox 3: Yes - Subscriptions can be moved between Management Groups provided the user has the required RBAC permissions.\nReference: https://docs.microsoft.com/en-us/azure/governance/management-groups/overview https://docs.microsoft.com/enus/azure/governance/management-groups/manage#moving-management-groups-and-subscriptions",
        "image": null
    },
    {
        "topic": 2,
        "id": 6,
        "text": "You have an Azure policy as shown in the following exhibit:\n[IMAGE DESCRIPTION:\nSCOPE\nScope: Subsctiption 1\nExclusions: Subscription 1/ContosoRG1\nBASICS\nPolicy definition: Not allowed resource types\nAssignment name: Not allowed resource types\nAssignment ID: /subscriptions/5eb8d0b6-ce3-4ce0-a631-9f5321bedabb/providers/Microsoft.Authorization/policyAssignments/0e6fb866bf854f54accae29\nAssignes by: admin1@contoso.com\nPARAMETERS\nNot allowed resource types: Microsoft.Sql/servers]\nWhat is the effect of the policy?",
        "answers": [
            {
                "letter": "A",
                "text": "You are prevented from creating Azure SQL servers anywhere in Subscription 1."
            },
            {
                "letter": "B",
                "text": "You can create Azure SQL servers in ContosoRG1 only."
            },
            {
                "letter": "C",
                "text": "You are prevented from creating Azure SQL Servers in ContosoRG1 only."
            },
            {
                "letter": "D",
                "text": "You can create Azure SQL servers in any resource group within Subscription 1."
            }
        ],
        "correct_answer": "B",
        "comment": "You are prevented from creating Azure SQL servers anywhere in Subscription 1 with the exception of ContosoRG1.\nComunity vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 7,
        "text": "HOTSPOT -\nYou have an Azure subscription that contains the resources shown in the following table:\n+--------+------------------+-------------------+--------------------+\n| Name   | Type             | Resource group    | Tag                |\n+--------+------------------+-------------------+--------------------+\n| RG6    | Resource group   | Not applicable    | None               |\n| VNET1  | Virtual network  | RG6               | Department: D1     |\n+--------+------------------+-------------------+--------------------+\nYou assign a policy to RG6 as shown in the following table:\n+------------+---------------------+-------------------------------+\n| Section    | Setting             | Value                         |\n+------------+---------------------+-------------------------------+\n| Scope      | Scope               | Subscription1/RG6             |\n| Scope      | Exclusions          | None                          |\n| Basics     | Policy definition   | Apply tag and its default value |\n| Basics     | Assignment name     | Apply tag and its default value |\n| Parameters | Tag name            | Label                         |\n| Parameters | Tag value           | Value1                        |\n+------------+---------------------+-------------------------------+\nTo RG6, you apply the tag: RGroup: RG6.\nYou deploy a virtual network named VNET2 to RG6.\nWhich tags apply to VNET1 and VNET2? To answer, select the appropriate options in the answer area.\nNOTE: Each correct selection is worth one point.\nHot Area:\nVNET:\n- None\n- Department: D1 only\n- Department D1, and RGroup: RG6 only\n- Department D1, and Label: Value1 only\n- Department D1, RGroup: RG6, and Label: Value1\nVNET2:\n- None\n- RGroup: RG6 only\n- Label: Value1 only\n- RGroup: RG6, and Label Value1",
        "answers": [
            {
                "letter": "A",
                "text": "VNET1 - None"
            },
            {
                "letter": "B",
                "text": "VNET1 - Department: D1 only"
            },
            {
                "letter": "C",
                "text": "VNET1 - Department: D1, and RGroup: RG6 only"
            },
            {
                "letter": "D",
                "text": "VNET1 - Department: D1, and Label: Value1 only"
            },
            {
                "letter": "E",
                "text": "VNET1 - Department: D1, RGroup: RG6, and Label: Value1"
            },
            {
                "letter": "F",
                "text": "VNET2 - None"
            },
            {
                "letter": "G",
                "text": "VNET2 - RGroup: RG6 only"
            },
            {
                "letter": "H",
                "text": "VNET2 - Label: Value1 only"
            },
            {
                "letter": "I",
                "text": "VNET2 - RGroup: RG6, and Label: Value1"
            }
        ],
        "correct_answer": "DH",
        "comment": "VNET1: Department: D1, and Label:Value1 only. Tags applied to the resource group or subscription are not inherited by the resources.\nNote: Azure Policy allows you to use either built-in or custom-defined policy definitions and assign them to either a specific resource group or across a whole Azure subscription.\nVNET2: Label:Value1 only.\nIncorrect Answers:\nRGROUP: RG6 - Tags applied to the resource group or subscription are not inherited by the resources.\nReference: https://docs.microsoft.com/en-us/azure/azure-resource-manager/management/tag-policies",
        "image": null
    },
    {
        "topic": 2,
        "id": 8,
        "text": "You have an Azure subscription named AZPT1 that contains the resources shown in the following table:\n+-------------+-----------------------------------------------+\n| Name        | Type                                          |\n+-------------+-----------------------------------------------+\n| storage1    | Azure Storage account                         |\n| VNET1       | Virtual network                               |\n| VM1         | Azure virtual machine                         |\n| VM1Managed  | Managed disk for VM1                          |\n| RVAULT1     | Recovery Services vault for the site recovery of VM1 |\n+-------------+-----------------------------------------------+\nYou create a new Azure subscription named AZPT2.\nYou need to identify which resources can be moved to AZPT2.\nWhich resources should you identify?",
        "answers": [
            {
                "letter": "A",
                "text": "VM1, storage1, VNET1, and VM1Managed only"
            },
            {
                "letter": "B",
                "text": "VM1 and VM1Managed only"
            },
            {
                "letter": "C",
                "text": "VM1, storage1, VNET1, VM1Managed, and RVAULT1"
            },
            {
                "letter": "D",
                "text": "RVAULT1 only"
            }
        ],
        "correct_answer": "C",
        "comment": "You can move resources between subscriptions if they are in the same Azure Active Directory (Azure AD) tenant and meet certain conditions. In this case, VM1, storage1, VNET1, VM1Managed, and RVAULT1 can all be moved to AZPT2 as they are all part of the same tenant and meet the requirements for moving resources.\nReference: https://docs.microsoft.com/en-us/azure/azure-resource-manager/management/move-resource-group-and-subscription\n Community vote distribution C (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 9,
        "text": "You recently created a new Azure subscription that contains a user named Admin1.\nAdmin1 attempts to deploy an Azure Marketplace resource by using an Azure Resource Manager template. Admin1 deploys the template by using Azure PowerShell and receives the following error message: `User failed validation to purchase resources. Error message: `Legal terms have not been accepted for this item on this subscription. To accept legal terms, please go to the Azure portal (http://go.microsoft.com/fwlink/?LinkId=534873) and configure programmatic deployment for the Marketplace item or create it there for the first time.`\nYou need to ensure that Admin1 can deploy the Marketplace resource successfully.\nWhat should you do?",
        "answers": [
            {
                "letter": "A",
                "text": "From Azure PowerShell, run the Set-AzApiManagementSubscription cmdlet"
            },
            {
                "letter": "B",
                "text": "From the Azure portal, register the Microsoft.Marketplace resource provider"
            },
            {
                "letter": "C",
                "text": "From Azure PowerShell, run the Set-AzMarketplaceTerms cmdlet"
            },
            {
                "letter": "D",
                "text": "From the Azure portal, assign the Billing administrator role to Admin1"
            }
        ],
        "correct_answer": "C",
        "comment": "To resolve the error regarding unaccepted legal terms when deploying a Marketplace resource, you must accept the terms programmatically using PowerShell. The correct cmdlet is `Set-AzMarketplaceTerms`, which allows you to accept the legal terms for Marketplace items so they can be deployed through templates.\nReference: https://docs.microsoft.com/en-us/powershell/module/az.marketplaceordering/set-azmarketplaceterms?view=azps-4.1.0 Community vote distribution C (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 10,
        "text": "You have an Azure Active Directory (Azure AD) tenant that contains 5,000 user accounts.\nYou create a new user account named AdminUser1.\nYou need to assign the User administrator administrative role to AdminUser1.\nWhat should you do from the user account properties?",
        "answers": [
            {
                "letter": "A",
                "text": "From the Licenses blade, assign a new license"
            },
            {
                "letter": "B",
                "text": "From the Directory role blade, modify the directory role"
            },
            {
                "letter": "C",
                "text": "From the Groups blade, invite the user account to a new group"
            }
        ],
        "correct_answer": "B",
        "comment": "To assign the User administrator role to a user in Azure AD, you must use the Directory role blade in the user's properties. From there, you can add the desired role.\nSteps to assign a role to a user:\n1. Sign in to the Azure portal with an account that's a global admin or privileged role admin for the directory.\n2. Select Azure Active Directory, select Users, and then select a specific user from the list.\n3. For the selected user, select Directory role, select Add role, and then pick the appropriate admin roles from the Directory roles list, such as Conditional access administrator.\n4. Press Select to save.\nReference: https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/active-directory-users-assign-role-azure-portal\n",
        "image": null
    },
    {
        "topic": 2,
        "id": 11,
        "text": "You have an Azure Active Directory (Azure AD) tenant named contoso.onmicrosoft.com that contains 100 user accounts.\nYou purchase 10 Azure AD Premium P2 licenses for the tenant.\nYou need to ensure that 10 users can use all the Azure AD Premium features.\nWhat should you do?",
        "answers": [
            {
                "letter": "A",
                "text": "From the Licenses blade of Azure AD, assign a license"
            },
            {
                "letter": "B",
                "text": "From the Groups blade of each user, invite the users to a group"
            },
            {
                "letter": "C",
                "text": "From the Azure AD domain, add an enterprise application"
            },
            {
                "letter": "D",
                "text": "From the Directory role blade of each user, modify the directory role"
            }
        ],
        "correct_answer": "A",
        "comment": "To activate Azure AD Premium P2 features for specific users, you must assign the Premium license to each of them individually or through group-based licensing.\nReference: https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/license-users-groups\nCommunity vote distribution A (90%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 12,
        "text": "You have an Azure subscription named Subscription1 and an on-premises deployment of Microsoft System Center Service Manager.\nSubscription1 contains a virtual machine named VM1.\nYou need to ensure that an alert is set in Service Manager when the amount of available memory on VM1 is below 10 percent.\nWhat should you do first?",
        "answers": [
            {
                "letter": "A",
                "text": "Create an automation runbook"
            },
            {
                "letter": "B",
                "text": "Deploy a function app"
            },
            {
                "letter": "C",
                "text": "Deploy the IT Service Management Connector (ITSM)"
            },
            {
                "letter": "D",
                "text": "Create a notification"
            }
        ],
        "correct_answer": "C",
        "comment": "The IT Service Management Connector (ITSMC) integrates Azure with supported ITSM tools like System Center Service Manager. It enables the creation of work items based on Azure alerts, such as a memory threshold breach.\nReference: https://docs.microsoft.com/en-us/azure/azure-monitor/platform/itsmc-overview\nCommunity vote distribution C (84%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 13,
        "text": "You sign up for Azure Active Directory (Azure AD) Premium P2.\nYou need to add a user named admin1@contoso.com as an administrator on all the computers that will be joined to the Azure AD domain.\nWhat should you configure in Azure AD?",
        "answers": [
            {
                "letter": "A",
                "text": "Device settings from the Devices blade"
            },
            {
                "letter": "B",
                "text": "Providers from the MFA Server blade"
            },
            {
                "letter": "C",
                "text": "User settings from the Users blade"
            },
            {
                "letter": "D",
                "text": "General settings from the Groups blade"
            }
        ],
        "correct_answer": "A",
        "comment": "When you connect a Windows device with Azure AD using an Azure AD join, Azure AD adds the following security principles to the local administrators group on the device:\n- The Azure AD global administrator role\n- The Azure AD device administrator role\n- The user performing the Azure AD join\nIn the Azure portal, you can manage the device administrator role on the Devices page. To open the Devices page:\n1. Sign in to your Azure portal as a global administrator or device administrator.\n2. On the left navbar, click Azure Active Directory.\n3. In the Manage section, click Devices.\n4. On the Devices page, click Device settings.\n5. To modify the device administrator role, configure Additional local administrators on Azure AD joined devices.\nReference: https://docs.microsoft.com/en-us/azure/active-directory/devices/assign-local-admin\nCommunity vote distribution A (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 14,
        "text": "HOTSPOT -\nYou have Azure Active Directory tenant named Contoso.com that includes following users:\n+--------+-----------------------------+\n| Name   | Role                        |\n+--------+-----------------------------+\n| User1  | Cloud device administrator  |\n| User2  | User administrator          |\n+--------+-----------------------------+\nContoso.com includes following Windows 10 devices:\n+---------+---------------------+\n| Name    | Join type           |\n+---------+---------------------+\n| Device1 | Azure AD registered |\n| Device2 | Azure AD joined     |\n+---------+---------------------+\nYou create following security groups in Contoso.com:\n+--------+-------------------+--------+\n| Name   | Membership Type   | Owner  |\n+--------+-------------------+--------+\n| Group1 | Assigned           | User2  |\n| Group2 | Dynamic Device     | User2  |\n+--------+-------------------+--------+\nFor each of the following statements, select Yes if the statement is true. Otherwise, select No.\nNOTE: Each correct selection is worth one point.\nHot Area:\n- User1 can add Device 2 to Group1 (Y/N)\n - User2 can add Device 1 to Group1 (Y/N)\nUser2 can add Device2 to Group2 (Y/N)\n\n ---> Per rispondere Yes ad uno statement, indica Y dopo la lettera; per rispondere No, indica N (es. tutte vere rispondi AYBYCY - IN ORDINE ALFABETICO!) <---",
        "answers": [
            {
                "letter": "A",
                "text": "User1 can add Device2 to Group1."
            },
            {
                "letter": "B",
                "text": "User2 can add Device1 to Group1."
            },
            {
                "letter": "C",
                "text": "User2 can add Device2 to Group2."
            }
        ],
        "correct_answer": "AYBNCY",
        "comment": "Statement 1 - Yes:\n- User1 is a Cloud Device Administrator\n- Device2 is Azure AD joined\n- Group1 has the assigned to join type. User1 is the owner of Group1.\nStatement 2 - No:\n- User2 is a User Administrator.\n- Device1 is Azure AD registered.\n- Group1 has the assigned join type, and the owner is User1.\nNote: Azure AD registered devices utilize an account managed by the end user, this account is either a Microsoft account or another locally managed credential.\nStatement 3 - Yes:\n- User2 is a User Administrator.\n- Device2 is Azure AD joined.\n- Group2 has the Dynamic Device join type, and the owner is User2.\nReference: https://docs.microsoft.com/en-us/azure/active-directory/devices/overview",
        "image": null
    },
    {
        "topic": 2,
        "id": 15,
        "text": "You have an Azure subscription that contains a resource group named RG26. RG26 is set to the West Europe location and is used to create temporary resources for a project. RG26 contains the resources shown in the following table:\n+-------+--------------------------+--------------+\n| Name  | Type                     | Location     |\n+-------+--------------------------+--------------+\n| VM1   | Virtual machine          | North Europe |\n| RGV\\  | Recovery Services vault  | North Europe |\n| SQLD01| SQL server in Azure VM   | North Europe |\n| sa001 | Storage account          | West Europe  |\n+-------+--------------------------+--------------+\nSQLDB01 is backed up to RGV1. When the project is complete, you attempt to delete RG26 from the Azure portal. The deletion fails. You need to delete RG26. What should you do first?",
        "answers": [
            {
                "letter": "A",
                "text": "Delete VM1"
            },
            {
                "letter": "B",
                "text": "Stop VM1"
            },
            {
                "letter": "C",
                "text": "Stop the backup of SQLDB01"
            },
            {
                "letter": "D",
                "text": "Delete sa001"
            }
        ],
        "correct_answer": "C",
        "comment": "The deletion of the resource group RG26 fails because SQLDB01 is backed up to RGV1. You must stop the backup of SQLDB01 first to successfully delete the resource group.\nCommunity vote distribution: C (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 16,
        "text": "You have an Azure subscription named Subscription1 that contains a virtual network named VNet1. VNet1 is in a resource group named RG1. Subscription1 has a user named User1. User1 has the following roles:\n Reader\n Security Admin\n Security Reader\nYou need to ensure that User1 can assign the Reader role for VNet1 to other users.\nWhat should you do?",
        "answers": [
            {
                "letter": "A",
                "text": "Remove User1 from the Security Reader and Reader roles for Subscription1."
            },
            {
                "letter": "B",
                "text": "Assign User1 the User Access Administrator role for VNet1."
            },
            {
                "letter": "C",
                "text": "Assign User1 the Network Contributor role for VNet1."
            },
            {
                "letter": "D",
                "text": "Assign User1 the Network Contributor role for RG1."
            }
        ],
        "correct_answer": "B",
        "comment": "Has full access to all resources including the right to delegate access to others.\nNote:\nThere are several versions of this question in the exam. The question has two possible correct answers:\n- Assign User1 the User Access Administrator role for VNet1.\n- Assign User1 the Owner role for VNet1.\nOther incorrect answer options you may see on the exam include the following:\n- Assign User1 the Contributor role for VNet1.\n- Remove User1 from the Security Reader and Reader roles for Subscription1. Assign User1 the Contributor role for Subscription1.\n- Remove User1 from the Security Reader role for Subscription1. Assign User1 the Contributor role for RG1.\nReference: https://docs.microsoft.com/en-us/azure/role-based-access-control/overview\nCommunity vote distribution B (86%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 17,
        "text": "You have an Azure Active Directory (Azure AD) tenant named contosocloud.onmicrosoft.com. Your company has a public DNS zone for contoso.com. You add contoso.com as a custom domain name to Azure AD. You need to ensure that Azure can verify the domain name. Which type of DNS record should you create?",
        "answers": [
            {
                "letter": "A",
                "text": "MX"
            },
            {
                "letter": "B",
                "text": "NSEC"
            },
            {
                "letter": "C",
                "text": "PTR"
            },
            {
                "letter": "D",
                "text": "RRSIG"
            }
        ],
        "correct_answer": "A",
        "comment": "To verify your custom domain name (example)\n1. Sign in to the Azure portal using a Global administrator account for the directory.\n2. Select Azure Active Directory, and then select Custom domain names.\n3. On the Fabrikam - Custom domain names page, select the custom domain name, Contoso.\n4. On the Contoso page, select Verify to make sure your custom domain is properly registered and is valid for Azure AD. Use either the TXT or the MX record type.\nNote:\nThere are several versions of this question in the exam. The question can have two correct answers:\n1. MX\n2. TXT\nThe question can also have other incorrect answer options, including the following:\n1. SRV\n2. NSEC3\nReference: https://docs.microsoft.com/en-us/azure/dns/dns-web-sites-custom-domain\nCommunity vote distribution A (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 18,
        "text": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\n\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\n\nYou have an Azure Directory (Azure AD) tenant named Adatum and an Azure Subscription named Subscription1. Adatum contains a group named Developers. Subscription1 contains a resource group named Dev.\n\nYou need to provide the Developers group with the ability to create Azure logic apps in the Dev resource group.\n\nSolution: On Subscription1, you assign the DevTest Labs User role to the Developers group.\n\nDoes this meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "DevTest Labs User role only lets you connect, start, restart, and shutdown virtual machines in your Azure DevTest Labs.\nThe Logic App Contributor role lets you manage logic app, but not access to them. It provides access to view, edit, and update a logic app.\nReference: https://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles https://docs.microsoft.com/en-us/azure/logic-apps/logicapps-securing-a-logic-app\nCommunity vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 19,
        "text": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\n\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\n\nYou have an Azure Directory (Azure AD) tenant named Adatum and an Azure Subscription named Subscription1. Adatum contains a group named Developers. Subscription1 contains a resource group named Dev.\n\nYou need to provide the Developers group with the ability to create Azure logic apps in the Dev resource group.\n\nSolution: On Subscription1, you assign the Logic App Operator role to the Developers group.\n\nDoes this meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "B",
        "comment": "You would need the Logic App Contributor role.\nReference: https://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles https://docs.microsoft.com/en-us/azure/logic-apps/logicapps-securing-a-logic-app\nCommunity vote distribution B (100%)",
        "image": null
    },
    {
        "topic": 2,
        "id": 20,
        "text": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.\n\nAfter you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.\n\nYou have an Azure Directory (Azure AD) tenant named Adatum and an Azure Subscription named Subscription1. Adatum contains a group named Developers. Subscription1 contains a resource group named Dev.\n\nYou need to provide the Developers group with the ability to create Azure logic apps in the Dev resource group.\n\nSolution: On Dev, you assign the Contributor role to the Developers group.\n\nDoes this meet the goal?",
        "answers": [
            {
                "letter": "A",
                "text": "Yes"
            },
            {
                "letter": "B",
                "text": "No"
            }
        ],
        "correct_answer": "A",
        "comment": "The Contributor role can manage all resources (and add resources) in a Resource Group.\nCommunity vote distribution A (100%)",
        "image": null
    }
]